from telethon import TelegramClient
import asyncio
import time
from telethon import events

print('''
██████╗░███████╗██╗░░░██╗███████╗██╗░░░░░░█████╗░██████╗░███████╗██████╗░░██████╗  ░░░░░░
██╔══██╗██╔════╝██║░░░██║██╔════╝██║░░░░░██╔══██╗██╔══██╗██╔════╝██╔══██╗██╔════╝  ░░░░░░
██║░░██║█████╗░░╚██╗░██╔╝█████╗░░██║░░░░░██║░░██║██████╔╝█████╗░░██████╔╝╚█████╗░  █████╗
██║░░██║██╔══╝░░░╚████╔╝░██╔══╝░░██║░░░░░██║░░██║██╔═══╝░██╔══╝░░██╔══██╗░╚═══██╗  ╚════╝
██████╔╝███████╗░░╚██╔╝░░███████╗███████╗╚█████╔╝██║░░░░░███████╗██║░░██║██████╔╝  ░░░░░░
╚═════╝░╚══════╝░░░╚═╝░░░╚══════╝╚══════╝░╚════╝░╚═╝░░░░░╚══════╝╚═╝░░╚═╝╚═════╝░  ░░░░░░
██╗██╗░█████╗░██╗░░██╗██╗██╗██╗
╚█║╚█║██╔══██╗██║░██╔╝██║╚█║╚█║
░╚╝░╚╝██║░░██║█████═╝░██║░╚╝░╚╝
░░░░░░██║░░██║██╔═██╗░╚═╝░░░░░░
░░░░░░╚█████╔╝██║░╚██╗██╗░░░░░░
░░░░░░░╚════╝░╚═╝░░╚═╝╚═╝░░░░░░''')

print('Данная программа не нисет в себе ничего плохого и мы не заставляем использывать в плохих целях, с уважением разработчики - "Ok!"')
print('''P.S. - (Скрипт был разработан при поддержке программистов - "Ok!"
         Наш Discord: https://discord.gg/mxKZtFtMwp)''')

t = input("Введите сообщение для ответов: ")

api_id = '8449169'
api_hash = '20b6754029252ed4fa6c8fcdd465d9d7'

client = TelegramClient('Username', api_id, api_hash)

message = t

def main():

    client.start()
    
    @client.on(events.NewMessage(pattern='hi|hello|Hello|Hi|Привет|привет|Здарова|здарова|ку|Ку|Хеллоу|хеллоу|Хэллоу|хэллоу'))
    async def _(event):
        if event.is_private:
            time.sleep(1)  # pause for 1 second to rate-limit automatic replies
            await client.send_message(event.message.from_id, message)
    client.run_until_disconnected()
    print('приложение запущено!')


if __name__ == '__main__':
    main()